export const FLOOR_OPTIONS = [
  { value: '0', label: 'أرضي' },
  { value: '1', label: 'أول' },
  { value: '2', label: 'ثاني' },
  { value: '3', label: 'ثالث' },
  { value: '4', label: 'رابع' },
  { value: '5', label: 'خامس' },
];

export const FURNISHED_OPTIONS = [
  { value: 1, label: 'نعم' },
  { value: 0, label: 'لا' },
];

export const VIEW_OPTIONS = [
  { value: 'بحرية', label: 'بحرية' },
  { value: 'جبلية', label: 'جبلية' },
  { value: 'على الشارع', label: 'على الشارع' },
  { value: 'حديقة داخلية', label: 'حديقة داخلية' },
  { value: 'داخلية', label: 'داخلية' },
];

export const RENTAL_DURATION_OPTIONS = [
  { value: '1', label: 'شهر' },
  { value: '3', label: 'ثلاث شهور' },
  { value: '6', label: 'ستة شهور' },
  { value: '12', label: 'سنة' },
];


export const PAYMENT_OPTIONS = [
  "كاش",
  "شيكات",
  "كاش / تحويل"
];


export const ADDITIONAL_FEATURES = [
  "مصعد",
  "حديقة",
  "موقف سيارات",
  "حارس/أمن وحماية",
  "درج",
  "مخزن",
  "منطقة شواء",
  "نظام كهرباء احتياطي للطوارئ",
  "بركة سباحة",
  "انتركم",
  "انترنت",
  "تسهيلات لأصحاب الهمم",
];


export const FEATURES_BY_TYPE = {
  residential: [
    "تكييف مركزي",
    "مكيف",
    "تدفئة",
    "شرفة/بلكونة",
    "غرفة خادمة",
    "غرفة غسيل",
    "خزائن حائط",
    "مسبح خاص",
    "سخان شمسي",
    "زجاج شبابيك مزدوج",
    "جاكوزي",
    "مطبخ جاهز",
    "اباجورات كهرباء",
    "تدفئة تحت البلاط",
    "عسالة",
    "جلاية صحون",
    "مايكرويف",
    "فرن",
    "ثلاجة",
  ],
  commercial: [
    "تكييف مركزي",
    "بلكونة",
    "زجاج شبابيك مزدوج",
    "مطبخ جاهز",
    "مصعد",
    "مواقف خاصة",
    "حارس",
    "مخزن",
    "انترنت",
    "تسهيل لأصحاب الهمم",
  ],
  industrial: [
    "مصعد",
    "تكييف",
    "كهرباء توتر عالي",
    "منصة تحميل",
    "مواقف خاصة",
    "غرفة حارس",
    "CCTV",
  ],
  others: [
    "مصعد",
    "حديقة",
    "موقف سيارات",
    "حارس /\ أمن وحماية",
    "درج",
    "مخزن",
    "منطقة شواء",
    "نظام كهرباء احتياطي للطوارئ",
    "بركة سباحة",
    "انتركم",
    "انترنت",
    "تسهيلات لأصحاب الهمم",
  ],
};

export const NEARBY_LOCATION = [
  "مكان 1 ",
  "مكان 2 ",
  "مكان 3 ",
  "مكان 4 ",
  "مكان 5 ",
  "مكان 6 ",
  "مكان 7 ",
];
